CSI API ETABS v1
cFrameObj.Count Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count(
	string MyType = "All"
)
Function Count (
	Optional MyType As String = "All"
) As Integer
Dim instance As cFrameObj
Dim MyType As String
Dim returnValue As Integer
returnValue = instance.Count(MyType)
int Count(
	String^ MyType = L"All"
)
abstract Count :
        ?MyType : string
(* Defaults:
        let _MyType = defaultArg MyType "All"
*)
-> int
Parameters
MyType (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace